# Дана строка, состоящая из слов, разделенных пробелами.
# Определите, сколько в ней слов.

string = input()
substring = " "
pos = string.count(substring)
print(pos + 1)
