# Дана строка. Замените в этой строке все цифры 1 на слово one.

string = input()
substring = "one"
string = string.replace('1', substring)
print(string)
