#Дана строка. Удалите из этой строки все символы @.

string = input()
substring = ""
string = string.replace('@', substring)
print(string)
