#Дано положительное действительное число X. Выведите его дробную часть.

a = float(input())
b = a % 1
print(b)
