#Дано положительное двузначное число. Найдите число десятков в нем.

count = int(input())
print(count // 10)
