#Вводится целое неотрицательное число N (N≤100).
#Выведите 2ᴺ.

count = int(input())
print(2 ** count)
