#Дано натуральное число. Выведите его последнюю цифру.

count = int(input())
print(count % 10)
