#Напишите программу, которая считывает два целых числа A и B и выводит наибольшее значение из них.

chis1, chis2= int(input()), int(input())
if chis1 > chis2:
    print(chis1)
else:
    print(chis2)
